###############################################################################
# Created by write_sdc
# Fri Nov 25 15:03:15 2022
###############################################################################
current_design ALU
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 40.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {Operation[0]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {Operation[1]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {Operation[2]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {Operation[3]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[0]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[10]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[11]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[12]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[13]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[14]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[15]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[16]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[17]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[18]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[19]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[1]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[20]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[21]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[22]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[23]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[24]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[25]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[26]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[27]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[28]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[29]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[2]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[30]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[31]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[3]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[4]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[5]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[6]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[7]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[8]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a_operand[9]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[0]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[10]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[11]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[12]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[13]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[14]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[15]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[16]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[17]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[18]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[19]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[1]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[20]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[21]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[22]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[23]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[24]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[25]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[26]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[27]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[28]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[29]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[2]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[30]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[31]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[3]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[4]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[5]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[6]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[7]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[8]}]
set_input_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b_operand[9]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[0]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[10]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[11]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[12]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[13]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[14]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[15]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[16]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[17]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[18]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[19]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[1]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[20]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[21]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[22]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[23]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[24]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[25]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[26]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[27]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[28]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[29]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[2]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[30]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[31]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[3]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[4]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[5]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[6]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[7]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[8]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {ALU_Output[9]}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {Exception}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {Overflow}]
set_output_delay 8.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {Underflow}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {Exception}]
set_load -pin_load 0.0334 [get_ports {Overflow}]
set_load -pin_load 0.0334 [get_ports {Underflow}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[31]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[30]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[29]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[28]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[27]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[26]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[25]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[24]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[23]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[22]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[21]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[20]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[19]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[18]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[17]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[16]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[15]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[14]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[13]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[12]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[11]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[10]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[9]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[8]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[7]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[6]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[5]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[4]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[3]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[2]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[1]}]
set_load -pin_load 0.0334 [get_ports {ALU_Output[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Operation[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Operation[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Operation[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Operation[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_operand[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_operand[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
